import { studentModel } from "./model.js";

// 짧문

let studentLetter = [
  new studentModel(
    "사민재",
    "선생님 모자란 저를 가르쳐주셔서 감사합니다....... 선생님 덕분에 저도 모르는 새에 크게 성장했습니다. 감사합니다!"
  ),
  new studentModel(
    "신솔비",
    "안녕하세요, 선생님! 지난 5주간 정말 감사했습니다. 선생님의 강의 덕분에 개발 입문을 재미있게 할 수 있었던 것 같아요. 수업시간에 배운 것을 바탕으로 열심히 성장하는 개발자가 되겠습니다. 그동안 정말 감사했습니다!"
  ),

  new studentModel(
    "박성윤",
    "안녕하세요! 벌써 5주가 지났다니  선생님께서 재미있게 알려주셔서 시간이 더욱 빨리 지나간 것 같습니다.단순 코드만 작성하는 사람이 아닌 개발자로서 한발자국 내딛을 수 있게 도와주신 선생님께 감사드립니다."
  ),
  new studentModel(
    "송하늬",
    "5주라는 길다면 길고 짧다면 짧은 기간동안 깊고 넓게배웠습니다. 첫 프론트엔드 공부라 많이 긴장되고 걱정도 많았는데 선생님의 수업을 들으면서 많이 안심이 되었고, 앞으로 잘 해나갈 수 있을거라는 생각도 들었습니다. 너무 감사했고 앞으로 하시는길 모두 잘 되시길 바라겠습니다."
  ),
  new studentModel(
    "박연하[보조강사]",
    "짧은 시간이었지만 슬비쌤과 시작을 함께 할 수 있어서 즐거웠습니다! 목 건강 조심하시고 다음 기회에 또 뵐 수 있으면 좋겠어요 😃"
  ),

  new studentModel(
    "윤유영",
    "안녕하세요. 처음 선생님 성함을 들었을 때부터 인상 깊게 느껴졌는데,짧은 시간이었지만 수업을 통해 더 오래 기억에 남을 것 같습니다.선생님과 함께한 시간은 길지 않았지만,매일이 새롭고 재미있으면서도 한편으로는 스스로를 다시 돌아보게 되는 시간이었습니다.책상에 앉아 다시 펜을 잡고, 잘 되지 않는 것들을 반복해서 시도해보는 과정 속에서‘아직 내가 무언가를 배울 수 있구나’라는 감정을 다시 느끼게 되었습니다.특히 새로운 영역임에도 불구하고차근차근 이끌어 주신 수업 덕분에 '힘들다..'보다는 '역시 해보길 잘했다!'라는 생각이 더 크게 들었습니다.그 중심에 선생님의 강의가 있었다고 생각합니다.비록 한 달 남짓한 시간이었지만,저에게는 꽤 큰 용기와 동기부여, 그리고 새로운 눈을 얻을 수 있었던 수업이었습니다. 감사해요..아직 강의가 조금 더 남아 있지만,미리 감사 인사를 전하고 싶었습니다.그동안 정말 고생 많으셨고, 진심으로 감사드립니다.ps. 저도 이름 특이하다는 말 많이 듣는데....... 제 이름 기억해주실거죠?맞아요. 저 내로남불이에요.. 기억해주세요오.."
  ),
  new studentModel(
    "장예지",
    "슬비쌤 ~! 처음에 4주동안의 시간이 어떻게 지나갈까, 나는 과연 4주를 잘 버텨낼 수 있을까 라는 생각으로 개강을 맞이하게 되었는데, 선생님과 함께 하는 4주동안 주입식의 학습이 아닌, 다양한 접근 방식으로 사고할 수 있고 또 어떻게 하면 개발자로서 ‘바른’ 방향의 코딩을 할 수 있는지에 대해 알 수 있었던 정말 ‘따듯한’ 코딩 수업이었습니다.초반에는 라는 단어에 초점이 맞춰져 진도에만 집중되어 4주동안 쉴틈없이 달릴 줄만 알았는데, 선생님과 함께 하는 4주는 물론 거침없이 다양한 개념에 대해서 배웠지만 ㅎㅎ 철학적인 관점에서 개발을 바라보는 시간을 가져볼 수 있는 시간을 저에게 정말 만들어 주셔서 정말 의미있는 시간이었습니다.취업과 별개로 저의 삶을 놓고 보면 저는 선생님 덕분에 제가 모르던 분야를 선생님과 함께하는 동안 하루하루 배워갈 수 있던 시간들이었고, 이 시기는 저에게는 개발 분야에 대해 한걸음 입문하여 알아갈 수 있는, 어떻게 보면 하나의 새로운 세상을 또 알아가는 의미 있는 시간이었다고 생각합니다.선생님과 함께하는 4주동안 정말 많은 것들을 배울 수 있어서 좋았습니다. 처음에는 코드치는게 두려웠는데 지금은 두려울 때도 있지만 제가 작성한 코드가 바라는 의도대로 결과가 나올 때, 또는 새롭고 유용한 속성들을 배웠을 때 신기하고, 얼른 써보고 싶은 욕구가 드는 순간들이 적지 않게 생기게 되었습니다!! 정말 수업 시작하기 전에는 제가 이러한 재미를 느낄 것이라고는 자세히 생각해보지 못했는데, 선생님의 명쾌하고, 다각도로 문제를 보여주시는 가르침으로 인해 저는 이런 감정들도 경험해볼 수 있었다고 생각이 들어요. 선생님 4주동안 저희들에게 열정적으로 수업을 가르쳐주셔서 감사합니다. 저는 저의 코딩의 시작을 슬비쌤과 함께 할 수 있어서 다행이라는 생각이 들어요. 첫 단추를 옷 구멍에 아주 잘 꿰매 넣은 것처럼 기초를 바르게 잡을 수 있수록 기반을 다져주신 선생님입니다!! 회고도 종종 이후에도 들여다볼 것 같습니다!! ㅎㅎ 선생님 17기 개강 전까지 슬비쌤도 체력 보충하시고 나중에 저희 16기와 또 다시 만나는 기회가 있었으면 좋겠어요! 잠깐 쌤과 함께 상담하는 순간도 좋았습니다 ㅎㅎ 선생님 그동안 정말정말 고생많으셨고 감사했습니다!! 건강하시고 늘 행복한 일이 더 많으셨으면 좋겠습니다!!💓"
  ),
  new studentModel(
    "김효경",
    "안녕하세요 슬비쌤!슬비쌤 슬비쌤~ 많이 불러보고 싶었던 이름이었는데 수업이 숨가쁘게 진행 되다 보니 이제야 이렇게 불러보네요!시간이 어떻게 갔는지도 모르게 정말 쉬지 않고 열강을 펼치지느라 정말 고생 많으셨습니다.앞으로 살면서 다시 이런 강의를 들을 수 있을까 싶을 정도로 너무 뜻깊고 값진 배움의 시간이었습니다어떻게 저 방대한 지식들을, 게댜가 업데이트도 완벽히 된 내용들로 저렇게 쏟아내실수 있지 하며 감탄하며 수업을 들었어요슬비쌤 자체만으로 굉장히 큰 본보기가 되었답니다!헤어짐이 너무나도 아쉽지만 만남이 있으면 헤어짐이 있고 추억할 수 있기에 더 아름다운게 인연 아니겠냐며...슬비쌤은 오래도록 자주 꺼내보게 되는 인연이 될 것 같습니다!언젠가 다른 곳에서의 연을 기약하며 부디 몸 건강히 밝은 모습으로 웃을 수 있는 일만 있길 바랄게요!다시 한 번 정말 감사하고, 고생 많으셨습니다!!"
  ),
  new studentModel(
    "문유정",
    "슬비쌤과 함께했던 프론트엔드와의 첫 경험! 연고 없던 타지에 홀로 남겨진 듯 막막했는데, 친절하게 이끌어 주셔서 정말 즐겁고 마음이 든든했습니다!"
  ),
  new studentModel(
    "이주연",
    "슬비쌤께부트캠프 시작을 슬비쌤과 함께해서 정말 좋았습니다.매일 최선을 다해 수업해 주셔서 너무 감사했고,그 덕분에 저도 더 집중해서 배우려고 노력할 수 있었던 것 같습니다.특히 기본부터 차근차근 설명해 주시는 수업 덕분에정말 제대로 배우고 있다는 생각이 들었고,부트캠프의 시작이 한층 더 든든하게 느껴졌습니다!슬비쌤과 함께한 한 달이라는 시간이 정말 빠르게 흘러갔고,돌아보면 많이 배우고 느낄 수 있었던 시간이었습니다.좋은 출발을 만들어 주셔서 진심으로 감사드리며,배운 내용 잘 쌓아가면서 끝까지 열심히 해보겠습니다.감사합니다."
  ),

  new studentModel(
    "김근영",
    "짧다면 짧고 길다면 길었던 약 5주의 시간동안의 시간동안 정말 많은것들을 배웠습니다 양질의 자료와 열정적인 강의 정말 감사합니다. 앞으로도 슬비쌤께 배운 지식 + 프론트엔드 개발자로서의 모토를 기억하며 좋은 프론트엔드 개발자로 성장해나가겠습니다! 그동안 정말 감사했습니다 슬비쌤의 앞날에도 늘 좋은 일만 가득하시길 바래요 항상 응원하겠습니다!🥲❤️"
  ),
  new studentModel(
    "김한결",
    "수업을 통해 HTML과 CSS를 단순히 쓰는 수준을 넘어, 구조와 의도를 이해하며 코드를 바라보는 눈을 기를 수 있었습니다✨ 특히 Git을 깊이 있게 배울 수 있었던 점이 큰 자산이 되었습니다. 덕분에 개발자로서의 시야가 한층 넓어졌다고 느낍니다! 진짜 이렇게 세세하게 개념 설명해주시고, 이해시키고 실습하는 강의는 슬비쌤 강의가 유일하다고 생각해요!! ❣ 배운 내용을 바탕으로 좋은 프론트엔드 개발자로 성장하겠습니다. 한 달 동안 너무 뜻깊고 소중한 시간이였습니다. 훗날 기업 특강으로 다시 배울 기회가 있다면 꼭 다시 만나뵙고 싶어요! 감사합니다💘 2025년 마무리 잘하시고 항상 건강하세요 💪"
  ),
  new studentModel(
    "정인우",
    "완전 초심자인 저도 잘 알아들을 수 있는 좋은 수업 감사드리고, 상담 시간에 해주신 말씀 잘 생각해보면서 좋은 개발자가 되도록 노력 하겠습니다! 감사합니다!!"
  ),
  new studentModel(
    "이정론",
    "슬비쌤, 짧지만 긴 수업 시간 동안 열정적으로 가르쳐 주셔서 정말 감사드립니다! 슬비쌤 덕분에 어제보다 더 성장하고, 공부하는 습관이 배어 가고 있습니다. 접근성 측면에서 구조를 바라보는 시각과 CSS의 동작 원리를 더 깊이 이해할 수 있었던 알찬 수업이었습니다. 크리스마스와 새해 연휴 동안 푹 쉬시면서 편안한 시간 보내시길 바랍니다. 😀"
  ),
  new studentModel(
    "백희연",
    "안녕하세요 선생님!11월 18일 첫만남이 엊그제 같은데 벌써 5주라는 시간이 흘렀네요 ㅎㅎ시간이 참 빠릅니다.그만큼 정신없이 또 완벽하게 이해하지는 못했지만 나름대로 열심히 달려온 시간이겠지요선생님 수업 덕분에 몰랐던 코드지식들과 그 동안 내심 끙끙 앓기만 했던 답답한 부분을 시원하게 해결해 주셔서 정말 감사합니다.배운 부분 열심히 복습하여 훌륭한(?) 디발자? 가 되어보도록 더 노력하겠습니다! ㅎㅎ5주동안 감사했습니다!"
  ),
  new studentModel(
    "이찬미",
    "안녕하세요 데레사선생님!요즘 사회에서 좋은 어른을 만난다는것은 손꼽히는 행운입니다.단지 키보드만 두드리는 개발자가 아닌 웹페이지를 어떻게 만들어야할지 생각하게 해주신 가르침으로어떻게 개발을 해야하는지 인간 개발자로써 방향성을 잡을 수 있었습니다. 수업시간 중간에 해주시는 재밌는 이야기들 덕분에 어려운 부분이 나와도 웃으며 많은 에너지 받았습니다!선생님과 공부했던 5주라는 시간이 너무 짧아서 아쉽습니다ㅠㅠ프로젝트 기간때 시간 나시면 꼭 !!!! 놀러오세요 … (안되겠죠 ? 하하)그리고 목이 많이 아프실거 같아요ㅠㅜ ! 따뜻한 생강레몬차 추천드립니다 🙂좋은 개발자가 되어서 찾아뵈었으면 좋겠습니다. 짧은 기간이였지만 정말 감사드립니다 🙂"
  ),
  new studentModel(
    "이동헌",
    "지난 5주간, 지루할 줄 알았던 HTML/CSS에서 가장 많은 걸 배운 것 같습니다! 프론트엔드 뿐만 아니라 웹 퍼블리싱에 대해서 좀 더 많은 테크닉과 생각할거리를 배웠던 것 같습니다. 정말 뜻깊은 5주였습니다. 감사합니다!!!"
  ),
];

export { studentLetter };
